const jilla: TJilla = [
  {
    jilla: 'কুষ্টিয়া',
    subJilla: [
      'কুমারখালী',
      'কুষ্টিয়া সদর',
      'খোকসা',
      'দৌলতপুর',
      'ভেড়ামারা',
      'মিরপুর'
    ]
  },

  {
    jilla: 'খুলনা',
    subJilla: [
      'কয়রা',
      'ডুমুরিয়া',
      'তেরখাদা',
      'দাকোপ',
      'দিঘলিয়া',
      'পাইকগাছা',
      'ফুলতলা',
      'বটিয়াঘাটা',
      'রূপসা'
    ]
  },

  {
    jilla: 'চুয়াডাঙ্গা',
    subJilla: ['আলমডাঙ্গা', 'চুয়াডাঙ্গা সদর', 'জীবননগর', 'দামুড়হুদা']
  },

  {
    jilla: 'ঝিনাইদহ',
    subJilla: [
      'কালীগঞ্জ',
      'কোটচাঁদপুর',
      'ঝিনাইদহ সদর',
      'মহেশপুর',
      'শৈলকুপা',
      'হরিণাকুন্ডু'
    ]
  },

  { jilla: 'নড়াইল', subJilla: ['কালিয়া', 'নড়াইল সদর', 'লোহাগড়া'] },

  {
    jilla: 'বাগেরহাট',
    subJilla: [
      'কচুয়া',
      'চিতলমারী',
      'ফকিরহাট',
      'বাগেরহাট সদর',
      'মোংলা',
      'মোড়েলগঞ্জ',
      'মোল্লাহাট',
      'রামপাল',
      'শরণখোলা'
    ]
  },

  {
    jilla: 'মাগুরা',
    subJilla: ['মাগুরা সদর', 'মোহাম্মদপুর', 'শালিখা', 'শ্রীপুর']
  },

  { jilla: 'মেহেরপুর', subJilla: ['গাংনী', 'মেহেরপুর সদর', 'মুজিবনগর'] },

  {
    jilla: 'যশোর',
    subJilla: [
      'অভয়নগর',
      'কেশবপুর',
      'চৌগাছা',
      'ঝিকরগাছা',
      'বাঘারপাড়া',
      'মনিরামপুর',
      'যশোর সদর',
      'শার্শা'
    ]
  },

  {
    jilla: 'সাতক্ষীরা',
    subJilla: [
      'আশাশুনি',
      'কলারোয়া',
      'কালীগঞ্জ',
      'তালা',
      'দেবহাটা',
      'শ্যামনগর',
      'সাতক্ষীরা সদর'
    ]
  },

  {
    jilla: 'চট্টগ্রাম',
    subJilla: [
      'আনোয়ারা',
      'কর্ণফুলি',
      'চন্দনাইশ',
      'পটিয়া',
      'ফটিকছড়ি',
      'বাঁশখালী',
      'বোয়ালখালী',
      'মীরসরাই',
      'রাউজান',
      'রাঙ্গুনিয়া',
      'লোহাগাড়া',
      'সন্দ্বীপ',
      'সাতকানিয়া',
      'সীতাকুণ্ড',
      'হাটহাজারী'
    ]
  },

  {
    jilla: 'কক্সবাজার',
    subJilla: [
      'উখিয়া',
      'কক্সবাজার সদর',
      'কুতুবদিয়া',
      'চকরিয়া',
      'টেকনাফ',
      'পেকুয়া',
      'মহেশখালী',
      'রামু',
      'ঈদগাঁও'
    ]
  },

  {
    jilla: 'বান্দরবান',
    subJilla: [
      'আলিকদম',
      'থানচি',
      'নাইক্ষ্যংছড়ি',
      'বান্দরবান সদর',
      'রুমা',
      'রোয়াংছড়ি',
      'লামা'
    ]
  },

  {
    jilla: 'খাগড়াছড়ি',
    subJilla: [
      'খাগড়াছড়ি সদর',
      'দীঘিনালা',
      'পানছড়ি',
      'মহালছড়ি',
      'মাটিরাঙ্গা',
      'মানিকছড়ি',
      'রামগড়',
      'লক্ষীছড়ি',
      'গুইমারা'
    ]
  },

  {
    jilla: 'রাঙ্গামাটি',
    subJilla: [
      'কাউখালী',
      'কাপ্তাই',
      'জুরাছড়ি',
      'নানিয়াচর',
      'বরকল',
      'বাঘাইছড়ি',
      'বিলাইছড়ি',
      'রাঙ্গামাটি সদর',
      'রাজস্থলী',
      'লংগদু'
    ]
  },

  {
    jilla: 'নোয়াখালী',
    subJilla: [
      'নোয়াখালী সদর',
      'বেগমগঞ্জ',
      'চাটখিল',
      'কোম্পানীগঞ্জ',
      'হাতিয়া',
      'সেনবাগ',
      'সুবর্ণ চর',
      'সোনাইমুড়ি',
      'কবিরহাট'
    ]
  },

  {
    jilla: 'লক্ষ্মীপুর',
    subJilla: ['কমলনগর', 'রামগঞ্জ', 'রামগতি', 'রায়পুর', 'লক্ষ্মীপুর সদর']
  },

  {
    jilla: 'ফেনী',
    subJilla: [
      'ফেনী সদর',
      'দাগনভূঁইয়া',
      'সোনাগাজী',
      'ছাগলনাইয়া',
      'পরশুরাম',
      'ফুলগাজী'
    ]
  },

  {
    jilla: 'কুমিল্লা',
    subJilla: [
      'বরুরা',
      'চান্দিনা',
      'দাউদকান্দি',
      'লাকসাম',
      'ব্রাহ্মণপাড়া',
      'বুড়িচং',
      'চৌদ্দগ্রাম',
      'দেবীদ্বার',
      'হোমনা',
      'মুরাদনগর',
      'লাঙ্গলকোট',
      'মেঘনা',
      'তিতাস',
      'মনোহরগঞ্জ',
      'কুমিল্লা সদর',
      'সদর দক্ষিণ',
      'লালমাই'
    ]
  },

  {
    jilla: 'চাঁদপুর',
    subJilla: [
      'চাঁদপুর সদর',
      'হাজীগঞ্জ',
      'কচুয়া',
      'ফরিদগঞ্জ',
      'মতলব উত্তর',
      'মতলব দক্ষিণ',
      'হাইমচর',
      'শাহরাস্তি'
    ]
  },

  {
    jilla: 'ব্রাহ্মণবাড়িয়া',
    subJilla: [
      'আশুগঞ্জ',
      'আখাউড়া',
      'কসবা',
      'নবীনগর',
      'নাসিরনগর',
      'বাঞ্ছারামপুর',
      'ব্রাহ্মণবাড়িয়া সদর',
      'সরাইল',
      'বিজয়নগর'
    ]
  },

  {
    jilla: 'ঢাকা',
    subJilla: ['ধামরাই', 'দোহার', 'কেরানীগঞ্জ', 'নবাবগঞ্জ', 'সাভার']
  },

  {
    jilla: 'নরসিংদী',
    subJilla: ['বেলাবো', 'মনোহরদী', 'শিবপুর', 'রায়পুরা', 'পলাশ', 'নরসিংদী সদর']
  },

  {
    jilla: 'নারায়ণগঞ্জ',
    subJilla: ['নারায়ণগঞ্জ সদর', 'বন্দর', 'আড়াইহাজার', 'রূপগঞ্জ', 'সোনারগাঁও']
  },

  {
    jilla: 'গাজীপুর',
    subJilla: ['কালিয়াকৈর', 'কালীগঞ্জ', 'কাপাসিয়া', 'গাজীপুর সদর', 'শ্রীপুর']
  },

  {
    jilla: 'মুন্সীগঞ্জ',
    subJilla: [
      'শ্রীনগর',
      'সিরাজদিখান',
      'লৌহজং',
      'টংগিবাড়ী',
      'মুন্সীগঞ্জ সদর',
      'গজারিয়া'
    ]
  },

  {
    jilla: 'মানিকগঞ্জ',
    subJilla: [
      'ঘিওর',
      'দৌলতপুর',
      'মানিকগঞ্জ সদর',
      'শিবালয়',
      'সাটুরিয়া',
      'সিঙ্গাইর',
      'হরিরামপুর'
    ]
  },

  {
    jilla: 'টাঙ্গাইল',
    subJilla: [
      'টাঙ্গাইল সদর',
      'কালিহাতি',
      'ঘাটাইল',
      'বাসাইল',
      'গোপালপুর',
      'মির্জাপুর',
      'ভূঞাপুর',
      'নাগরপুর',
      'মধুপুর',
      'সখিপুর',
      'দেলদুয়ার',
      'ধনবাড়ী'
    ]
  },

  {
    jilla: 'রাজবাড়ী',
    subJilla: [
      'রাজবাড়ী সদর',
      'গোয়ালন্দ',
      'পাংশা',
      'বালিয়াকান্দি',
      'কালুখালী'
    ]
  },

  {
    jilla: 'গোপালগঞ্জ',
    subJilla: [
      'গোপালগঞ্জ সদর',
      'মুকসুদপুর',
      'কাশিয়ানী',
      'কোটালীপাড়া',
      'টুঙ্গিপাড়া'
    ]
  },

  {
    jilla: 'শরীয়তপুর',
    subJilla: [
      'শরীয়তপুর সদর',
      'ডামুড্যা',
      'নড়িয়া',
      'ভেদরগঞ্জ',
      'জাজিরা',
      'গোসাইরহাট'
    ]
  },

  {
    jilla: 'মাদারীপুর',
    subJilla: ['মাদারীপুর সদর', 'শিবচর', 'কালকিনি', 'রাজৈর', 'ডাসার']
  },

  {
    jilla: 'ফরিদপুর',
    subJilla: [
      'ফরিদপুর সদর',
      'বোয়ালমারী',
      'আলফাডাঙা',
      'মধুখালী',
      'ভাঙ্গা',
      'নগরকান্দা',
      'চর ভদ্রাসন',
      'সদরপুর',
      'সালথা'
    ]
  },

  {
    jilla: 'কিশোরগঞ্জ',
    subJilla: [
      'কিশোরগঞ্জ সদর',
      'অষ্টগ্রাম',
      'ইটনা',
      'করিমগঞ্জ',
      'কটিয়াদি',
      'কুলিয়ারচর',
      'তাড়াইল',
      'নিকলী',
      'পাকুন্দিয়া',
      'বাজিতপুর',
      'ভৈরব',
      'মিটামইন',
      'হোসেনপুর'
    ]
  },

  {
    jilla: 'বরিশাল',
    subJilla: [
      'আগৈলঝাড়া',
      'বাকেরগঞ্জ',
      'বাবুগঞ্জ',
      'বানারীপাড়া',
      'গৌরনদী',
      'হিজলা',
      'বরিশাল সদর',
      'মেহেন্দিগঞ্জ',
      'মুলাদী',
      'উজিরপুর'
    ]
  },

  {
    jilla: 'বরগুনা',
    subJilla: ['বরগুনা সদর', 'আমতলী', 'তালতলী', 'পাথরঘাটা', 'বেতাগি', 'বামনা']
  },

  {
    jilla: 'ভোলা',
    subJilla: [
      'চরফ্যাশন',
      'তজমুদ্দিন',
      'দৌলতখান',
      'বোরহানউদ্দিন',
      'ভোলা সদর',
      'মনপুরা',
      'লালমোহন'
    ]
  },

  {
    jilla: 'ঝালকাঠি',
    subJilla: ['কাঁঠালিয়া', 'ঝালকাঠি সদর', 'নলছিটি', 'রাজাপুর']
  },

  {
    jilla: 'পটুয়াখালী',
    subJilla: [
      'পটুয়াখালী সদর',
      'বাউফল',
      'দশমিনা',
      'গলাচিপা',
      'কলাপাড়া',
      'মির্জাগঞ্জ',
      'দুমকি',
      'রাঙ্গাবালী'
    ]
  },

  {
    jilla: 'পিরোজপুর',
    subJilla: [
      'কাউখালী',
      'নাজিরপুর',
      'নেছারাবাদ (স্বরূপকাঠি)',
      'পিরোজপুর সদর',
      'ভান্ডারিয়া',
      'মঠবাড়িয়া',
      'ইন্দুরকানী'
    ]
  },

  {
    jilla: 'ময়মনসিংহ',
    subJilla: [
      'ময়মনসিংহ সদর',
      'ত্রিশাল',
      'গৌরীপুর',
      'মুক্তাগাছা',
      'ফুলপুর',
      'তারাকান্দা',
      'হালুয়াঘাট',
      'ভালুকা',
      'ফুলবাড়িয়া',
      'গফরগাঁও',
      'ঈশ্বরগঞ্জ',
      'নান্দাইল',
      'ধোবাউড়া'
    ]
  },

  {
    jilla: 'শেরপুর',
    subJilla: ['ঝিনাইগাতী', 'নকলা', 'নালিতাবাড়ী', 'শেরপুর সদর', 'শ্রীবরদী']
  },

  {
    jilla: 'জামালপুর',
    subJilla: [
      'জামালপুর সদর',
      'বকশীগঞ্জ',
      'দেওয়ানগঞ্জ',
      'ইসলামপুর',
      'মাদারগঞ্জ',
      'মেলান্দহ',
      'সরিষাবাড়ি'
    ]
  },

  {
    jilla: 'নেত্রকোণা',
    subJilla: [
      'আটপাড়া',
      'বারহাট্টা',
      'দুর্গাপুর',
      'খালিয়াজুড়ি',
      'কলমাকান্দা',
      'কেন্দুয়া',
      'মদন',
      'মোহনগঞ্জ',
      'নেত্রকোণা সদর',
      'পূর্বধলা'
    ]
  },

  {
    jilla: 'রংপুর',
    subJilla: [
      'রংপুর সদর',
      'বদরগঞ্জ',
      'গংগাচড়া',
      'কাউনিয়া',
      'মিঠাপুকুর',
      'পীরগাছা',
      'পীরগঞ্জ',
      'তারাগঞ্জ'
    ]
  },

  {
    jilla: 'দিনাজপুর',
    subJilla: [
      'বিরামপুর',
      'বীরগঞ্জ',
      'বোচাগঞ্জ',
      'ফুলবাড়ী',
      'চিরিরবন্দর',
      'ঘোড়াঘাট',
      'হাকিমপুর',
      'কাহারোল',
      'খানসামা',
      'দিনাজপুর সদর',
      'নবাবগঞ্জ',
      'পার্বতীপুর',
      'বিরল'
    ]
  },

  {
    jilla: 'গাইবান্ধা',
    subJilla: [
      'গাইবান্ধা সদর',
      'ফুলছড়ি',
      'গোবিন্দগঞ্জ',
      'পলাশবাড়ী',
      'সাদুল্লাপুর',
      'সাঘাটা',
      'সুন্দরগঞ্জ'
    ]
  },

  {
    jilla: 'কুড়িগ্রাম',
    subJilla: [
      'উলিপুর',
      'কুড়িগ্রাম সদর',
      'চর রাজিবপুর',
      'চিলমারী',
      'নাগেশ্বরী',
      'ফুলবাড়ী',
      'ভুরুঙ্গামারী',
      'রাজারহাট',
      'রৌমারী'
    ]
  },

  {
    jilla: 'নীলফামারী',
    subJilla: [
      'নীলফামারী সদর',
      'ডোমার',
      'ডিমলা',
      'জলঢাকা',
      'কিশোরগঞ্জ',
      'সৈয়দপুর'
    ]
  },

  {
    jilla: 'পঞ্চগড়',
    subJilla: ['দেবীগঞ্জ', 'তেতুলিয়া', 'পঞ্চগড় সদর', 'আটোয়ারী', 'বোদা']
  },

  {
    jilla: 'ঠাকুরগাঁও',
    subJilla: [
      'ঠাকুরগাঁও সদর',
      'পীরগঞ্জ',
      'বালিয়াডাঙ্গী',
      'রানীশংকৈল',
      'হরিপুর'
    ]
  },

  {
    jilla: 'লালমনিরহাট',
    subJilla: [
      'আদিতমারী',
      'কালীগঞ্জ',
      'পাটগ্রাম',
      'লালমনিরহাট সদর',
      'হাতীবান্ধা'
    ]
  },

  {
    jilla: 'রাজশাহী',
    subJilla: [
      'বাঘা',
      'পুঠিয়া',
      'পবা',
      'বাগমারা',
      'তানোর',
      'মোহনপুর',
      'চারঘাট',
      'গোদাগারী',
      'দূর্গাপুর'
    ]
  },

  {
    jilla: 'নাটোর',
    subJilla: [
      'নাটোর সদর',
      'বাগাতিপাড়া',
      'বরাইগ্রাম',
      'গুরুদাসপুর',
      'লালপুর',
      'সিংড়া',
      'নলডাঙ্গা'
    ]
  },

  {
    jilla: 'চাঁপাইনবাবগঞ্জ',
    subJilla: [
      'চাঁপাইনবাবগঞ্জ সদর',
      'গোমস্তাপুর',
      'শিবগঞ্জ',
      'নাচোল',
      'ভোলাহাট'
    ]
  },

  {
    jilla: 'জয়পুরহাট',
    subJilla: ['পাঁচবিবি', 'কালাই', 'ক্ষেতলাল', 'আক্কেলপুর', 'জয়পুরহাট সদর']
  },

  {
    jilla: 'নওগাঁ',
    subJilla: [
      'পত্নীতলা',
      'ধামুরহাট',
      'মহাদেবপুর',
      'পোরশা',
      'সাপাহার',
      'বদলগাছী',
      'মান্দা',
      'নিয়ামতপুর',
      'আত্রাই',
      'রানীনগর',
      'নওগাঁ সদর'
    ]
  },

  {
    jilla: 'বগুড়া',
    subJilla: [
      'আদমদিঘী',
      'বগুড়া সদর',
      'ধুনট',
      'দুপচাঁচিয়া',
      'গাবতলী',
      'কাহালু',
      'নন্দীগ্রাম',
      'সারিয়াকান্দি',
      'শেরপুর',
      'শিবগঞ্জ',
      'সোনাতলা',
      'শাজাহানপুর'
    ]
  },

  {
    jilla: 'পাবনা',
    subJilla: [
      'আটঘরিয়া',
      'ঈশ্বরদী',
      'চাটমোহর',
      'পাবনা সদর',
      'ফরিদপুর',
      'বেড়া',
      'ভাঙ্গুরা',
      'সাঁথিয়া',
      'সুজানগর'
    ]
  },

  {
    jilla: 'সিরাজগঞ্জ',
    subJilla: [
      'উল্লাপাড়া',
      'কাজীপুর',
      'কামারখন্দ',
      'চৌহালি',
      'তাড়াশ',
      'বেলকুচি',
      'রায়গঞ্জ',
      'শাহজাদপুর',
      'সিরাজগঞ্জ সদর'
    ]
  },

  {
    jilla: 'মৌলভীবাজার',
    subJilla: [
      'বড়লেখা',
      'কুলাউড়া',
      'রাজনগর',
      'কমলগঞ্জ',
      'শ্রীমঙ্গল',
      'মৌলভীবাজার সদর',
      'জুড়ী'
    ]
  },

  {
    jilla: 'সিলেট',
    subJilla: [
      'বালাগঞ্জ',
      'বিয়ানীবাজার',
      'বিশ্বনাথ',
      'কোম্পানীগঞ্জ',
      'ফেঞ্চুগঞ্জ',
      'গোলাপগঞ্জ',
      'গোয়াইনঘাট',
      'জৈন্তাপুর',
      'কানাইঘাট',
      'সিলেট সদর',
      'জকিগঞ্জ',
      'দক্ষিণ সুরমা',
      'ওসমানীনগর'
    ]
  },

  {
    jilla: 'হবিগঞ্জ',
    subJilla: [
      'আজমিরীগঞ্জ',
      'চুনারুঘাট',
      'নবীগঞ্জ',
      'বানিয়াচং',
      'বাহুবল',
      'মাধবপুর',
      'লাখাই',
      'শায়েস্তাগঞ্জ',
      'হবিগঞ্জ সদর'
    ]
  },

  {
    jilla: 'সুনামগঞ্জ',
    subJilla: [
      'ছাতক',
      'জগন্নাথপুর',
      'জামালগঞ্জ',
      'তাহিরপুর',
      'শান্তিগঞ্জ',
      'দিরাই',
      'দোয়ারাবাজার',
      'ধর্মপাশা',
      'বিশ্বম্ভরপুর',
      'শাল্লা',
      'সুনামগঞ্জ সদর',
      'মধ্যনগর'
    ]
  }
]

export default jilla
